---
kind: other
id: Methods.T:Autodesk.Revit.DB.AreaScheme
source: html/c69f4f10-cfb2-c031-61e7-faf189d15035.htm
---
# AreaScheme Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.